{
##
## config.pl
## DBI認証プラグイン　動作設定ファイル
##

# -------------------------------------------------------------------------------------------------
# API::Authentication - 認証方式の設定
#
# typeに'DBI'を指定することで、認証方式にDBIを使用します。
#
    'API::Authentication' => {
        type => 'DBI',
    },

# -------------------------------------------------------------------------------------------------
# API::Authentication::DBI - DBI認証の詳細設定
#
# DBI認証に用いるDBIサーバの指定を行います。
# Authen::Simpleで使用できるパラメータと同じものを使うことができます。
#
    'API::Authentication::DBI' => {
        dsn => "dbi:mysql:cirque_auth",
        username => "root",
    },

};
